Revit 2024 API
BuiltInFailures.SketchFailures.StairNotEnoughRiserCurves Property
 Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairNotEnoughRiserCurves { get; }
Visual Basic
Public Shared ReadOnly Property StairNotEnoughRiserCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairNotEnoughRiserCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace